---
layout: post
title: Linux 系统管理10-进程和计划任务管理
date: 2020-08-07
tags: Linux系统管理
--- 

# 一、程序和进程的关系
### 1.程序
- 保存在硬盘、光盘等介质中的可执行代码和数据
- 静态保存的代码

### 2.进程
- 在 CPU 及内存中运行的程序代码
- 动态执行的代码
- 父、子进程:每一个进程可以创建一个或多个进程

# 二、静态查看进程统计信息 ps 命令
## 1.ps aux 命令
### (1)作用：
以简单列表的形式显示出进程信息
### (2)选项释义：

> a：显示当前终端下的所有进程信息，包括其他用户的进程
> 
> u：使用以用户为主的格式输出进程信息
> 
> x：显示当前用户在所有终端下的进程信息

### (3)示例：

![](/images/posts/01_sys/10/1.png)

## 2.ps -elf 命令
### (1)作用：
以长格式显示系统中的进程信息，并且包含更丰富的内容
### (2)选项释义：

> -e：显示系统内的所有进程信息
> 
> -l：显示长（long）格式显示进程信息
> 
> -f：使用完整的（full）格式显示进程信息

### (3)示例：

![](/images/posts/01_sys/10/2.png)

## 3.直接使用 ps 命令
直接执行不带任何选项的 ps 命令时，将只显示当前会话中打开的进程

![](/images/posts/01_sys/10/3.png)

## 4.查看某个进程的详细信息
### (1)ps aux|grep “进程名称”

![](/images/posts/01_sys/10/4.png)

### (2)ps -elf|grep "进程名称"

![](/images/posts/01_sys/10/5.png)

# 三、动态查看进程统计信息 top 命令
## 1.作用：
top 命令将会在当前终端以全屏交互式的界面显示进程排名，及时跟踪包括 CPU、内存等系统资源占用情况，默认情况下三秒刷新一次，默认以 CPU 占用率排序。

## 2.常用选项：

> -d：指定刷新的间隔事件，单位秒
> 
> -b：以批量处理模式操作，一般与 -n 同时使用
> 
> -n：指定循环显示的次数
> 
> -u：指定用户名
> 
> -p：指定进程号

## 3.各选项的使用示例：

### (1)top -d 指定刷新的间隔时间

```
[root@huyouba1 ~]# top -d 5 【指定刷新间隔时间为 5 秒】
```

### (2)top -b -n 以批量处理模式操作同时指定循环显示的次数

![](/images/posts/01_sys/10/6.png)

> 注意：当 CPU 占用率过高时，不应再直接执行 top 命令查看，可以将信息存入一个文件内查看，以免 CPU 占用率过高导致崩溃。操作如下：

![](/images/posts/01_sys/10/7.png)

### (3)top -u 指定用户名

![](/images/posts/01_sys/10/8.png)

### (4)top -p 指定进程号

![](/images/posts/01_sys/10/9.png)

## 4.常用交互命令

> P：根据 CPU 使用百分比大小进行排序（默认进入时即为此排序）
> 
> M：根据驻留内存大小进行排序
> 
> T：根据累计时间进行排序
> 
> k：终止一个进程
> 
> q：退出程序
> 
> r：重新安排一个进程的优先级别（-20 ~ 19）

## 5.解释：

![](/images/posts/01_sys/10/10.png)

```
top - 19:19:09        【当前系统时间】
up  1:21              【当前已经运行 1 小时 21 分钟】
3 users               【当前登录 2 个用户】
load average: 0.01,0.02,0.05    【系统平均负载：1 分钟的，5 分钟的，15 分钟的】
Tasks：97 total       【任务：97个总进程】
2 running             【2 个进程正在运行】
95 sleeping           【95 个进程睡眠】
0 stoppd              【0 个进程停止】
0 zombie              【0 个僵尸进程（冻结进程）】
%Cpu(s): 0.0 us       【用户控件占用 CPU 百分比】
0.7 sy                【内核空间占用 CPU 百分比】
0.0 ni                【用户进程控件内改变过优先级的进程占用 CPU 百分比】
99.3 id               【空闲 CPU 百分比】
0.0 wa                【等待输入输出的 CPU 时间百分比】
0.0 hi                【】
0.0 si                【】
Kib Mem：995896 total    【物理内存总量 995896k】
769896 free           【空闲 769896k 物理内存】
91716 used            【已使用 91716k 物理内存】
134284 buff/cache     【134284 用作内核缓存】
Kib Swap：2097148 total    【交换分区总量 2097148k 】
2097148 free          【空闲的交换分区总量 2097148k】
0 used                【没有使用交换分区】

PID:进程号

USER:进程所有者的用户名

PR:优先级

NI:nice 值。负值表示高优先级，正值表示低优先级 

VIRT:进程使用的虚拟内存总量，单位 kb 

RES:进程使用的、未被换出的物理内存大小，单位 kb 

SHR:共享内存大小，单位 kb

S:进程状态

%CPU:上次更新到现在的 CPU 时间占用百分比 

%MEM:进程使用的物理内存百分比 

TIME+:进程使用的 CPU 时间总计，单位 1/100 秒

COMMAND:命令
```

# 四、查看进程信息
## 1.pgrep 命令
### (1)作用：
根据特定条件查询 PID 信息
### (2)常用选项：

> -l：显示进程名
> 
> -U：指定特定用户
> 
> -t：指定终端

### (3)示例：

![](/images/posts/01_sys/10/11.png)

## 2.pstree 命令（需安装 psmisc）
### (1)作用：
以树形结构列出进程信息
### (2)常用选项：

> -a：显示完整信息
> 
> -u：列出对应用户名
> 
> -p：列出对应 PID 号
### (3)示例：

![](/images/posts/01_sys/10/12.png)

![](/images/posts/01_sys/10/13.png)

# 五、进程的启动方式
## 1.手工启动
### (1)前台启动：
用户输入命令，直接执行程序
### (2)后台启动：
在命令行尾加入 “&” 符号

![](/images/posts/01_sys/10/14.png)

### (3)进程的前后台调度

> 1> Ctrl+z 将当前进程挂起，即进入后台并停止执行
> 
> 2> jobs 命令，查看处于后台的任务列表，加 -l 通知显示 PID 号
> 
> 3> fg 命令，将后台进程恢复到前台运行，可指定任务序列号
> 
> 4> bg 命令，将后台暂停的进程调至后台运行

![](/images/posts/01_sys/10/15.png)

![](/images/posts/01_sys/10/16.png)

### (4)终止进程的运行
1> Ctrl+c 中断正在执行的命令

2> kill、killall 命令

kill 用于终止指定 PID 号的进程

killall 用于终止指定名称的所有进程
 
-9 选项用于强制终止

![](/images/posts/01_sys/10/17.png)

![](/images/posts/01_sys/10/18.png)

3> pkill 命令

作用：根据特定条件终止相应的进程

常用选项：

> -U：根据进程所属的用户名终止相应进程
> 
> -t：根据进程所在的终端终止相应进程

![](/images/posts/01_sys/10/19.png)

## 2.调度启动
### (1)使用 at 命令，设置一次性任务计划

1> 服务脚本：/usr/sbin/atd

2> 设置格式：

at [HH:MM] [yyyy-mm-dd] 设置当天的任务计划可不加日期

3> 基本操作：

> Ctrl + d 保存退出
> 
> atq 查询现有的一次性任务计划
> 
> atrm [任务序号] 删除第几项任务

4> 示例

> 【设置在今天的 20：40 自动执行：统计该时间点系统中由 root 用户运行的进程数量，并将该数值保存到 /tmp/ps.root 文件中】

![](/images/posts/01_sys/10/20.png)

> 【设置在 2019 年 11 月 30 日晚上 22：00 自动关机】

![](/images/posts/01_sys/10/21.png)

> 【设置七天后晚上 22：00 自动关机】

![](/images/posts/01_sys/10/22.png)

> 【设置明天晚上 22：00 重启 httpd 服务】

![](/images/posts/01_sys/10/23.png)

### (2)使用 crontal 命令，设置周期性计划任务

1> 脚本名称：/usr/sbin/crond

2> 主要配置文件：

- 全局配置文件：/etc/crontab

![](/images/posts/01_sys/10/24.png)

- 系统默认的设置：/etc/cron.*/

![](/images/posts/01_sys/10/25.png)

- 用户定义的设置：/var/spool/cron/用户名

3> 管理 cron 计划任务

- 编辑：crontab -e [-u 用户名]
- 查看：crontab -l [-u 用户名]
- 删除：crontab -r [-u 用户名]

> 注意：-u 选项只有root用户可用

4> crontab 任务配置的格式

![](/images/posts/01_sys/10/26.png)


5> 时间数值的特殊表示方法

```
 * 表示该范围内的任意时间

 ，表示间隔的多个不连续时间点

 - 表示一个连续的时间范围

 / 指定间隔的时间频率
 ```
 
![](/images/posts/01_sys/10/27.png)

### 示例：
每天早上 7：50 自动开启 sshd，22：50 关闭

每隔 5 天清空一次 FTP 服务器公告目录/var/ftp/pub

每周六 7:30 重启 httpd 服务

每周一、三、五的 17:30 打包备份/etc/httpd 目录

![](/images/posts/01_sys/10/28.png)
