---
layout: post
title: Linux 网络服务01-Linux 网络基础设置
date: 2020-08-07
tags: Linux网络服务
--- 

# 一、查看及测试网络
## 1.使用 ifconfig 命令查看网络接口（需安装net-tools）
### (1)查看活动的网络接口

```
ifconfig 命令
```

![](/images/posts/02_net/01/1.png)

### (2)查看所有网络接口

```
ifconfig -a
```

![](/images/posts/02_net/01/2.png)

### (3)查看指定的网络接口（不论该网络接口是否处于激活状态）

```
ifconfig 设备名
```

![](/images/posts/02_net/01/3.png)

### (4)ifconfig 命令包含的信息

```
inet :IPv4 地址    netmask:子网掩码    broadcast:广播地址 

inet6 :IPv6 地址

ether:物理地址(MAC 地址)    txqueuelen:发送列队长度

inet6 addr:IPv6 地址

RX packets:接收数据包    RX bytes:接收字节数

errors:错误    dropped:丢弃    overruns:过载    frame:帧数 

TX packets:发送数据包    TX bytes:发送字节数

errors:错误    dropped:丢弃    overruns:过载   carrier:载波    collisions:冲撞 
```

## 2.使用 ip、ethtool 命令查看网络接口
### (1)查看网络接口的数据链路层信息

```
ip link 命令
```

![](/images/posts/02_net/01/4.png)

### (2)查看网络接口的网络层信息

```
ip a （ip address）命令
```

![](/images/posts/02_net/01/5.png)

### (3)查看指定网络接口速率、模式等信息

```
ethtool 命令
```

![](/images/posts/02_net/01/6.png)

## 3.查看主机名、路由表
### (1)hostname 命令查看主机名称

![](/images/posts/02_net/01/7.png)

### (2)查看路由表
1> 使用 route 命令查看路由表

![](/images/posts/02_net/01/8.png)


2> 使用 netstat -r 命令查看路由表

![](/images/posts/02_net/01/9.png)

> -n：不执行 DNS 反向查看，直接显示数字形式的 IP 地址

![](/images/posts/02_net/01/10.png)


## 4.查看网络连接情况 netstat 命令
### (1)常用选项：


> -a：显示当前主机中所有活动的网络连接信息
> 
> -n：以数字的形式显示相关信息
> 
> -r：显示路由表信息
> 
> -t：显示 TCP 协议相关的信息
> 
> -u：显示 UDP 协议相关的信息
> 
> -p：显示与网络连接相关的进程号、进程名称信息（需要 rot 权限）


### (2)示例：

![](/images/posts/02_net/01/11.png)

## 5.ping、traceroute、nslookup 命令
### (1)测试网络连通性 ping 命令
1> 常用选项：


> -c：指定发送数据包的个数
> 
> -i：当 ping 通时，指定间隔多少秒发送下一个数据包
> 
> -w：当 ping 不通时，指定发送的每个数据包的超时时间，单位秒
> 
> -s：指定数据包大小


2>示例：

![](/images/posts/02_net/01/12.png)


### (2)跟踪数据包的路由途径 traceroute 命令（需安装）


> -n：不执行 DNS 反向查看，直接显示数字形式的 IP 地址


![](/images/posts/02_net/01/13.png)


# 【课外补充】

### 1.windows 中的 tracert 命令
在 cmd 中输入 tracert -d （-d 不将地址解析成主机名）

![](/images/posts/02_net/01/14.png)

### 2.常见的 TTL （Time To Live）生存周期值


windows：128

Linux：64

unix：255

cisco：255

### 3.测试 DNS 域名解析 nslookup 命令

![](/images/posts/02_net/01/15.png)

# 二、设置网络地址参数
## 1.临时修改网络设置
### (1)方法一：
ifconfig 网络设备 IP 地址/短格式子网掩码
### (2)方法二：ifconfig 网络设备 IP 地址 netmask 子网掩码
### (3)示例：

![](/images/posts/02_net/01/16.png)

![](/images/posts/02_net/01/17.png)

## 2.固定修改网络配置
### (1)配置文件：
/etc/sysconfig/network-scripts/ 目录下的 ifcfg-对应网络设备名称，默认第一块网卡为 eth0
### (2)编辑配置文件：前面带 # 表示非必要配置内容

```
DEVICE=ens33 设备名
HWADDR=00:0C:29:8F:D8:E0 物理地址(MAC 地址)
TYPE=Ethernet 类型(以太网) 
UUID=da840b8c-a2d8-4a09-83a8-50d5437c3ba3 UUID 号
ONBOOT=yes 是否开机自动启用
NM_CONTROLLED=no 图形化管理控制，是 network manger 的参数 
#BOOTPROTO=dhcp 自动获取;BOOTPROTO=static 手动配置 BOOTPROTO=static 引导协议(dhcp:自动获取;static/none:手动配置) 
IPADDR=192.168.100.100 IPv4 协议的 IP 地址
NETMASK=255.255.255.0 子网掩码
GATEWAY=192.168.100.1 网关
#USERCTL=no 是否允许非 root 用户控制该设备
#IPV6INIT=no 是否启用 IPv6 协议
#DNS1=202.106.46.151 DNS 域名解析服务
```

### (3)示例：
```
[root@huyouba1 ~]# vim /etc/sysconfig/network-scripts/ifcfg-ens33 
```

![](/images/posts/02_net/01/18.png)

##3.临时设置网卡子接口
### (1)方法：
ifconfig 网络设备:子接口名称 IP地址/段格式子网掩码
### (2)示例：

```
[root@huyouba1 ~]# ifconfig ens33:0 192.168.100.2/24

[root@huyouba1 ~]# ifconfig ens33:sec 192.168.200.2/24
```

![](/images/posts/02_net/01/19.png)

## 4.永久设置网卡子接口
### (1)方法：
需要在 /etc/sysconfig/network-scrips/ 目录下手动添加配置文件
### (2)示例：

```
[root@huyouba1 ~]# cd /etc/sysconfig/network-scripts/

[root@huyouba1 network-scripts]# cp ifcfg-ens33 ifcfg-ens33:0

[root@huyouba1 network-scripts]# vi ifcfg-ens33:0
```

![](/images/posts/02_net/01/20.png)

![](/images/posts/02_net/01/21.png)


## 5.临时修改网卡的状态
### (1)方法：
ifconfig 网络设备 up/down
### (2)示例：

```
[root@huyouba1 ~]# ifconfig  ens33 up

[root@huyouba1 ~]# ifconfig ens33:0 down
```

## 6.重新加载网络配置文件
### (1)重启网络服务以实现重新读取配置文件的目的
方法：systemctl restart network
### (2)修改某块网卡后，仅重启该网卡
1> 格式：ifdown 网络设备；ifup 网络设备

2> 示例：

![](/images/posts/02_net/01/22.png)

# 三、修改主机名
## 1.临时修改主机名
### (1)方法：
hostname 新的主机名

bash

### (2)示例：

![](/images/posts/02_net/01/23.png)

## 2.永久修改主机名
### (1)方法：
hostnamectl set-hostname 新的主机名
### (2)示例：

![](/images/posts/02_net/01/24.png)

# 四、配置路由
## 1.临时配置路由
### (1)临时添加、删除指定网段路由记录
1> 方法：


> route add -net 网段/段格式子网掩码 gw 网关地址
>
> route del -net 网段/段格式子网掩码

2> 示例：

![](/images/posts/02_net/01/25.png)

### (2)临时添加、删除默认网关记录
1> 方法：

> route add default gw 网关地址
> 
> route del default gw wang

2> 示例：
> 【添加默认网关记录】

![](/images/posts/02_net/01/26.png)

> 【删除默认网关记录】

![](/images/posts/02_net/01/27.png)


## 2.永久配置路由
### (1)方法一：在 /etc/rc.local 中添加

```
[root@huyouba1 ~]# vim /etc/rc.local
```

![](/images/posts/02_net/01/28.png)

> 保存退出，重启验证

### (2)方法二：修改 /etc/sysconfig/static-routes 配置文件（没有该文件手动建立）

```
[root@huyouba1 ~]# vim /etc/sysconfig/static-routes
```

![](/images/posts/02_net/01/29.png)

```
[root@huyouba1 ~]# systemctl restart network
```

### 方法三：开启 IP 转发（路由功能）
1> echo "1">/proc/sys/net/ipv4/ip_forward（临时开启）

2> vim /etc/sysctl.conf 将 net.ipv4.ip_forward=0 改为 1 （永久开启）

> sysctl -p （使 sysctl.conf 文件立即生效）


### 【临时开启 IP 转发功能】

```
[root@huyouba1 ~]# cat /proc/sys/net/ipv4/ip_forward
0

[root@huyouba1 ~]# echo "1" > /proc/sys/net/ipv4/ip_forward
1 
```
### 【永久开启 IP 转发功能】

```
[root@huyouba1 ~]# vim /etc/sysctl.conf 
```

![](/images/posts/02_net/01/30.png)

```
[root@huyouba1 ~]# sysctl -p   使 sysctl.conf 配置文件立即生效
net.ipv4.ip_forward = 1
```

# 五、设置 DNS 域名解析
## 1.设置 DNS 域名解析
### (1)方法一：
vi 编辑 /etc/sysconfig/network-scripts/ 目录下网络设备的配置文件

```
[root@huyouba1 ~]# vim /etc/sysconfig/network-scripts/ifcfg-ens33
```

![](/images/posts/02_net/01/31.png)

### (2)方法二：
vi 编辑 /etc/resolv.conf 文件

```
[root@huyouba1 ~]# vim /etc/resolv.conf 
```

![](/images/posts/02_net/01/22.png)

> 保存退出，此文件修改后立即生效

## 2.域名解析本地主机映射文件
### (1)方法：
vi 编辑 /etc/hosts 文件
### (2)说明：
/etc/hosts 文件优先于 DNS 域名解析服务，也就是说，如果一个域名在 hosts 文件已存在映射关系，将不再通过 DNS 服务器进行域名解析。hosts 文件中一个 IP 地址可以对应多个域名或者别名。
### （3）示例：
```
[root@huyouba1 ~]# vim /etc/hosts
```

![](/images/posts/02_net/01/33.png)

![](/images/posts/02_net/01/34.png)
